{"title": " Amazon.com", "text": " I own the Austin Reed dartmouth blazer in every color in which they make it-- it is a staple of my business wardrobe. Well made, quality fabric, nicely tailored, classic lines, appropriate for a professional woman. (something that can be hard to find at times) It should be noted, however, that the periwinkle and raspberry colors are lovely, but the fabric and buttons are slightly different than the \"classic\" colors(lighter) and the linings and interfacings are not as substantial as the brown, navy, camel, red and ivory. It's still a good value, particularly as these are colors appropriate to warmer seasons and climates, but I was a bit surprised.", "price": " unknown", "userId": " A3Q0VJTUO4EZ56", "helpfuless_count": 7, "helpfuless_score": 7, "summary": " Periwinkle Dartmouth Blazer", "score": " 4.0", "time": " 1182816000", "profileName": " Jeanmarie Kabala \"JP Kabala\"", "productId": " B000179R3I"}
{"title": " Nun Chuck, Novelty Nun Toss Toy", "text": " Got these last Christmas as a gag gift. They are great fun, but obviously this is not a toy that lasts!", "price": " 17.99", "userId": " ADX8VLDUOL7BG", "helpfuless_count": 0, "helpfuless_score": 0, "summary": " Great fun!", "score": " 5.0", "time": " 1262304000", "profileName": " M. Gingras", "productId": " B000GKXY34"}
{"title": " Nun Chuck, Novelty Nun Toss Toy", "text": " Gave this to my dad for a gag gift after directing \"Nunsense,\" he got a reall kick out of it!", "price": " 17.99", "userId": " A3NM6P6BIWTIAE", "helpfuless_count": 1, "helpfuless_score": 0, "summary": " more like funchuck", "score": " 3.0", "time": " 1224633600", "profileName": " Maria Carpenter", "productId": " B000GKXY34"}
{"title": " Its Only Art If Its Well Hung!", "text": " This is only for Julie Strain fans. It's a collection of her photos -- about 80 pages worth with a nice section of paintings by Olivia.If you're looking for heavy literary content, this isn't the place to find it -- there's only about 2 pages with text and everything else is photos.Bottom line", "price": " unknown", "userId": " AVCGYZL8FQQTD", "helpfuless_count": 7, "helpfuless_score": 7, "summary": " Nice collection of Julie Strain images", "score": " 4.0", "time": " 940636800", "profileName": " Jim of Oz \"jim-of-oz\"", "productId": " 1882931173"}
{"title": " ah", "text": " I hope a lot of people hear this cd. We need more strong and positive vibes like this. Great vocals, fresh tunes, cross-cultural happiness. Her blues is from the gut. The pop sounds are catchy and mature.", "price": " 15.99", "userId": " unknown", "helpfuless_count": 4, "helpfuless_score": 3, "summary": " Inspiring", "score": " 5.0", "time": " 939772800", "profileName": " unknown", "productId": " B00002066I"}
{"title": " ah", "text": " My lovely Pat has one of the GREAT voices of her generation. I have listened to this CD for YEARS and I still LOVE IT. When I'm in a good mood it makes me feel better. A bad mood just evaporates like sugar in the rain. This CD just oozes LIFE. Vocals are jusat STUUNNING and lyrics just kill. One of life's hidden gems. This is a desert isle CD in my book. Why she never made it big is just beyond me. Everytime I play this, no matter black, white, young, old, male, female EVERYBODY says one thing \"Who was that singing ?\"", "price": " 15.99", "userId": " A2KLYVAS0MIBMQ", "helpfuless_count": 0, "helpfuless_score": 0, "summary": " Great CD", "score": " 5.0", "time": " 1332288000", "profileName": " Stephen McClaning", "productId": " B00002066I"}
{"title": " Chrono Cross", "text": " We've come a long way since the days of Ninetendo synthesized music! I say without exaggeration that the Chrono Cross Original Soundtrack is probably some of the best instrumental music I've ever heard. Yasunori Mitsuda incorporates so many instruments and musical styles to this collection, it's a real credit to his talent. Guitars, violins, cellos and the piano are just a few of the instruments at play here. Although they differ greatly in musical style, I have to draw an analogy between Mitsuda's music here to the songs of the Grateful Dead", "price": " unknown", "userId": " A18C9SNLZWVBIE", "helpfuless_count": 1, "helpfuless_score": 1, "summary": " First album I've bought since Napster", "score": " 5.0", "time": " 1096934400", "profileName": " A reader", "productId": " B000058A81"}
{"title": " Chrono Cross", "text": " Final fantasy fans may be at first skeptical of Chrono Cross's composition and production under unknown Yasunori Mitsuda, but never fear, Uematsu serves a minor role as Executive Producer! Mistuda knew what music hit home in this Celtic-themed OST. Believe me, I was skeptical as a Final Fantasy fan, until I played the game and couldn't help sitting there listening to the music!The collection is a 3-CD masterpiece. The CD's are in tracks that are appropriately given up in chronological order, and you can picture playing through the game in your mind. What's awesome is the range of new instruments and styles in the sequel to the RPG of all RPGs. MIDI sequences can't show what the original version does in this OST. Rated a 10 by EGM for best music waaaay back in the day, it's not unfounded.Okay, so the insert is in japanese - keep in mind you can't find this thing in the states anymore. DigiCube's downfall makes it hard enough to find this thing, so grab it while you can. You can get translations in a variety of places that no longer have the CDs in stock (there are a few, believe me). If you loved the game, this is a required. If you are a video game music fan, consider it as essential as the FF7 OST and remember the name Yasunori Mitsuda.Things to keep an eye out for - Disc 1, Track 7 displays a theme that you hear throughout the game, and it sounds great to hear it again. All of Disc 3 is pure musical rewards, and Track 7 on it is... well, to avoid spoling too much... it's worth the $32 plus shipping. Oh, and for all the big press Radical Dreamers and Magical Dreamers get, it's worth it even if you haven't played the games all the way through - there aren't any spoilers to ruin the experience. Just pure, amazing rpg music worthy of the title of the game.I ordered this right before going on a Choir Concert Tour Ireland, and the Celtic themes helped me enjoy the experience to the fullest!Oh, if you're considering playing the game, do what I DID NOT DO, and what others hope to do - Play Chrono Trigger First, then Chrono Cross, if you can.", "price": " unknown", "userId": " A38QSOKE2DD8JD", "helpfuless_count": 1, "helpfuless_score": 1, "summary": " Pleasant to the ear, musical masterpiece", "score": " 5.0", "time": " 1088121600", "profileName": " Christopher Walden", "productId": " B000058A81"}
{"title": " Chrono Cross", "text": " This has got to be one of the best video game soundtracks ever. I've actually never really played the game, but somehow discovered the music of it, proving you don't have to like the game to like the soundtrack. I'm sure the game is also great, and maybe someday I'll purchase a PS2 and play it.The way the few different main themes are repeated throughout the discs makes it so much more epic and adventurous. The same notes, played at a different speed and with different instruments can have such different moods, and are certainly not repetitive.Many songs consist of synthesized violins, guitars, Japanese instruments and other stringed instruments, also pianos, interesting percussion, and many other synthesized sounds. The songs are made up of clear, well-produced melodious tones and notes. There are so many different moods on this cd... nostalgic, melancholic, joyful, tense, epic, pensive, spooky, calm, wondrous, ethereal, delightful, catchy... the list goes on. Of course, the music styles range from Celtic sounding, to traditional Japanese, to neoclassical, etc. all blended together nicely with Yasunori Mitsuda's special touch. A lot of the songs really make me think "epic" in one way or another. Many songs are also edgy or stressful like the music for a battle or difficult journey, but sometimes with a childlike tinge, suggesting the fantasy/anime aspect of the game (I'm not saying anime is childish, rather the music sounds that way at times, in a good way) Some songs have soaring melodies that revive the valiant atmosphere of the soundtrack, others have quite gloomy moods, some have simple, charming melodies, some have more spooky or haunting moods, some sound sort of like a big fairground or joyful gathering, and some have more of a feeling of a specific area like a maritime or tropical place - illustrating all the elements of a long, adventurous, tiring journey of many different perils, mysteries, and missions of all sizes.Obviously there are a lot of separate tracks on this soundtrack to encompass every single moment of music in the game (Why would you want to leave anything out?) but even the songs less than a minute are quite good. I'm not going to point out specific tracks because I'd end up listing about one-third of them, nor will I describe many specific tracks; every song is worth listening to, from start to finish. The most talked about song "Radical Dreamers" is a nice song with female vocals in Japanese that follows the main theme of the album, and I can see why most people consider it the best song on here, particularly the last minute or so with the angelic-like hum and amazing, gentle acoustic guitar melodies. The immaculate music box style melody after Radical Dreamers concludes the album with a very memorable sensation.I mentioned in my list of adjectives "nostalgic"", "price": " unknown", "userId": " AKZLIIH3AP4RU", "helpfuless_count": 1, "helpfuless_score": 1, "summary": " Much more than a game Soundtrack.", "score": " 5.0", "time": " 1075939200", "profileName": " IcemanJ", "productId": " B000058A81"}
{"title": " Chrono Cross", "text": " I used to find myself starting Chrono Cross over time and time again to listen to the theme song in the very beginning, but now I don't have to, thank god! Every song on this CD is absolutely magical. I've heard few better.", "price": " unknown", "userId": " A1FELZOGR5DEOM", "helpfuless_count": 1, "helpfuless_score": 1, "summary": " Amazing!", "score": " 5.0", "time": " 1035417600", "profileName": " Shadow", "productId": " B000058A81"}
